package L5_Logging;

public class LoggingTheory {
    // ================================================ Логгирование ================================================ \\

    // Логгирование - процесс записи информации о работе программы для последующего анализа
    //
    // Примеры информации, которую можно записывать в логи:
    //   - Сообщения об ошибках
    //   - Информация о ходе выполнения программы (какие функции вызываются, с какими параметрами)
    //   - Предупреждения о потенциальных проблемах
    //   - Данные о времени выполнения операций
    //
    // Пример использования встроенного логгера Java Logging API
    JavaLoggingAPI JLAPI;
    // Пример использования библиотеки логгирования Log4j
    Log4j log4j;
}
